'''
1. Підняти контейнер ElasticSearch

2. Отримати дані з CSV файлу, вивести на консоль кожну строку 
    як словник виду {ключ: значення} де ключами є відповідні поля першої строки, а  значеннями - відповідні 
    поля усіх наступних рядків взяті 

3. Відсортувати за датою, за алфавітом будь які вибрані поля що містять текст або дату

4. Здійснити пошук за регулярними виразами - декілька прикладів


5. Записати построчно інформацію у ElasticSearch.
    Що буде якщо нам знадобиться записати 100Мб? А якщо 10Гб? Яким чином прискорити запис у ElasticSearch?


6. Створити SPA-додаток на Vue який буде відображати дані з ElasticSearch у вигляді таблиці. 
    Таблиця має підтримувати пошук та сортування за колонками.
'''
